app/controllers/comments_controller.rb

  def update
    @comment.update(comment_params)
---
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "Nice experience."], ["updated_at", "2019-02-22 21:49:54.645517"], ["id", 161]]

  def set_post_comment
    @comment = @post.comments.find_by!(id: params[:id]) if @post
---
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 11], ["id", 201], ["LIMIT", 1]]