app/controllers/posts_controller.rb

  def create
    @post = Post.create!(post_params)
---
INSERT INTO "posts" ("title", "content", "created_by", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Learn Elm"], ["content", "Learn how to do things faster."], ["created_by", "Paul"], ["created_at", "2019-02-22 21:29:08.456334"], ["updated_at", "2019-02-22 21:29:08.456334"]]

  def update
    @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "My Weekend"], ["updated_at", "2019-02-22 21:29:08.583220"], ["id", 103]]